import Oksana from '@/assets/Oksana.jpg'
import Sofia from '@/assets/Sofia.jpg'

export default function Testimonials() {
	const testimonials = [
		{
			quote:
				'Хотіла сказати, що за ці два заняття з дісторшном, я уже відчула який у мене level up відбувся в чистому вокалі, це просто вау. Дякую, Яно, за те, що ти робиш 🫂💞. Я не тільки здійснюю свою мрію та навчаюся екстримальним технікам, але іще й закриваю діри, які у мене є в чистому вокалі.',
			author: 'Софія Некоз',
			img: Sofia.src,
		},
		{
			quote:
				'Я багато років співаю чистим вокалом і в мене був запит на освоєння техніки екстрим вокалу бо це моя давня мрія) Але досить довгий час моя мрія залишалась мрією бо я ніяк не могла знайти ту саму людину, до якої мені було б комфортно звернутися. А для мене це завжди було першочергово в такій справі адже екстрим це в принципі вихід із зони комфорту, тому особисто для мене критерій #1 це щоб людина імпонувала і з нею в принципі було комфортно проводити час на уроці. До Яни в мене була одна спроба навчання з іншим викладачем, але не склалося і тепер зрозуміло чому)) Для себе я виділила декілька ключових пунктів, з яких особисто для мене складається поняття топовий викладач: 1. Комфорт. З Яною мені дуже-дуже комфортно як на уроках, так і в комунікації в цілому. Вона дуже відкрита, підтримуюча, з гарним почуттям гумору і просто гарна, позитивна і добра людина. Всі мої переживання з приводу а як же я буду оце щось пробувати кричати і намагатися видавати дивні звуки зникли на першому ж уроці бо Яна сама ж так робить(😅) і з нею робити всяке дивне не викликало якихось здивувань чи дискомфорту. 2. Професіоналізм. Звісно мені було важливо щоб викладач, до якого я прийду, повноцінно володів навичками екстрим вокалу і в цілому був професіоналом своєї справи саме на практиці в першу чергу (на моєму шляху зустрічалися викладачі, які розуміються на екстримі тільки в теорії). Тут я точно не прогадала, так як Яна чудово володіє різними техніками екстриму, плюс мене до сих пір дуже вражає наскільки добре вона володіє теоретичною базою. Яна постійно вчиться новому і це дуже сильно відчувається на уроках.3. Свідоме навчання. Це більше відноситься безпосередньо до мене, але стало можливим завдяки підходу до навчання, який пропонує Яна. Для того, щоб дійсно навчитися екстриму мені важливо було розуміти механізм всього що відбувається на фізіологічному рівні в організмі. Саме тоді я це усвідомлюю і починаю розуміти. А коли розумію, я починаю це пробувати робити. Так от Яна максимально детально все розказала і що ще головніше показала на собі. Тому в мене все і вийшло) Я обожнюю Яну і щиро рекомендую її як викладача вокалу і сподіваюсь мій відгук допоможе комусь наважитись на цей крок 😊',
			author: 'Оксана Андреєва',
			img: Oksana.src,
		},
	]

	return (
		<section className='py-20 px-4 bg-gray-950' id='reviews'>
			<div className='container mx-auto'>
				<h2 className='text-3xl md:text-4xl font-bold text-center mb-12'>
					Відгуки{' '}
					<span className='text-transparent bg-clip-text bg-gradient-to-r from-red-500 to-purple-500'>
						учнів
					</span>
				</h2>

				<div className='grid gap-8 max-w-4xl mx-auto'>
					{testimonials.map((testimonial, index) => (
						<div
							key={index}
							className='bg-gray-800/50 p-8 rounded-xl border border-gray-700 relative'
						>
							<svg
								className='absolute top-6 left-6 text-gray-600 w-8 h-8'
								fill='currentColor'
								viewBox='0 0 32 32'
								aria-hidden='true'
							>
								<path d='M9.352 4C4.456 7.456 1 13.12 1 19.36c0 5.088 3.072 8.064 6.624 8.064 3.36 0 5.856-2.688 5.856-5.856 0-3.168-2.208-5.472-5.088-5.472-.576 0-1.344.096-1.536.192.48-3.264 3.552-7.104 6.624-9.024L9.352 4zm16.512 0c-4.8 3.456-8.256 9.12-8.256 15.36 0 5.088 3.072 8.064 6.624 8.064 3.264 0 5.856-2.688 5.856-5.856 0-3.168-2.304-5.472-5.184-5.472-.576 0-1.248.096-1.44.192.48-3.264 3.456-7.104 6.528-9.024L25.864 4z' />
							</svg>
							<p className='text-lg italic text-gray-300 mb-6 pl-10'>
								{testimonial.quote}
							</p>
							<div className='flex items-center gap-4 pl-10'>
								<img
									src={testimonial.img}
									alt={testimonial.author}
									className='w-[50px] h-[50px] rounded-full'
								/>
								<p className='text-red-400 font-medium '>
									{testimonial.author}
								</p>
							</div>
						</div>
					))}
				</div>
			</div>
		</section>
	)
}
